package com.lec.ex01_string;

public class Ex06_regex {
   public static void main(String[] args) {
	  String str = "010-9999-9999 1111@naver.com (031)3888-9999 ¹İ°©½À´Ï´Ù. 888888-2888888 daewqd@naver.com ¾È³çÇÏ¼¼¿ä abc@hong.co.kr";
	  //System.out.println("replace =>" +str.replace("0", "È«")); // 0¸¸ È«À¸·Î ¹Ù²ñ
	  // Á¤±ÔÇ¥Çö½Ä
	  // 1. ÂüÁ¶ : goo.gl/HLntbd
	  // 2. °£·« ¹®¹ı
	  //    \\ d(¼ıÀÚ¿Í ¸ÅÄ¡, [0-9]¿Í µ¿ÀÏ)
	  //    \\ s(whitespacen : ½ºÆäÀÌ½º, ÅÇ, ¿£ÅÍ)
	  //    \\ w(¿µ¹®ÀÚ³ª ¼ıÀÚ, [a-zA-z0-9]¿Í µ¿ÀÏ)
	  //    \\ W(¿µ¹®ÀÚ³ª ¼ıÀÚ°¡ ¾Æ´Ñ ¹®ÀÚ.)
	  //       . (¹®ÀÚ ÇÏ³ª)
	  //       + (1¹øÀÌ»ó ¹İº¹)
	  //       * (0¹øÀÌ»ó ¹İº¹)
	  //       ? (0-1¹ø ¹İº¹)
	  // 3. ¿¬½ÀÀå regexr.com
	  //  ex. ÀüÈ­ ¹øÈ£ Á¤±ÔÇ¥Çö½ÄÀº ´ÙÀ½°ú °°´Ù.
	  // .?([0-9]){2,3}.[0-9]{3,4}-[0-9]{4} ÀüÈ­¹øÈ£ Á¤±ÔÇ¥Çö½Ä
	  // [(]?[0-9][)]{2,3}.\D[0-9]{3,4}-[0-9]{4}
	  //      010            1111       1111
	  // 4. Æ¯Á¤ Á¤±Ô Ç¥Çö½ÄÀÇ ¹®ÀÚ¿­ º¯°æ : replaceAll("Á¤±ÔÇ¥Çö½Ä", "´ëÃ¼¹®ÀÚ¿­")
	  //    - \w+@\w+(.\w+){1,2} ÀÌ¸ŞÀÏ Á¤±Ô Ç¥Çö½Ä
	
	  System.out.println(str.replaceAll(".?([0-9]){2,3}.[0-9]{3,4}-[0-9]{4}", "ÀüÈ­¹øÈ£ Áö¿ò"));
	  // ÀüÈ­¹øÈ£ Áö¿ò½Ä
	  System.out.println(str.replaceAll("\\w+@\\w+(.\\w+){1,2}", "***ÀÌ¸ŞÀÏ Áö¿ò ***"));
      // ÀÌ¸ŞÀÏ Áö¿ò
	  System.out.println(str.replaceAll("[a-zA-Z]", ""));
      // ¾ËÆÄºªÀ» Áö¿ò
	  System.out.println(str.replaceAll("[°¡-ÆR¤¡-¤¾]", ""));
      // ÇÑ±Û Áö¿ò
	  System.out.println(str.replaceAll("[0-9]{7}", "*******")); // {7} = 7¹ø ¹İº¹
	  // ÁÖ¹Î¹øÈ£ µŞÀÚ¸® Áö¿ò
	  
   }
}







